import { useEffect } from 'react';
import { router } from 'umi';
import styles from './index.css';
const arr = [
  '01学习导入课.mp4',
  '02.1信息与信息化.mp4',
  '02.2国家信息化战略和规划.mp4',
  '02.3电子政务.mp4',
  '02.4企业信息化和两化深度融合.mp4',
  '02.5商业智能.mp4',
  '02.6数据库与数据仓库.mp4',
  '02.7数据仓库Data Warehouse.mp4',
  '03.1.1信息系统生命周期.mp4',
  '03.1.2信息系统开发方法.mp4',
  '03.2信息系统设计.mp4',
  '03.3软件工程.mp4',
  '03.4面向对象技术.mp4',
  '03.5软件架构.mp4',
  '03.6典型应用集成技术.mp4',
  '04.1网络技术标准与协议.mp4',
  '04.2计算机网络分类.mp4',
  '04.3网络交换、存储技术.mp4',
  '04.4网络规划与设计.mp4',
  '05.1数据加密与认证.mp4',
  '05.2信息系统安全.mp4',
  '05.3网络安全.mp4',
  '05.4物理安全管理.mp4',
  '05.5人员安全管理.mp4',
  '05.6应用系统安全管理.mp4',
  '06.1信息系统集成及服务.mp4',
  '06.2信息系统集成及服务资质管理.mp4',
  '06.3IT服务管理及信息系统审计.mp4',
  '07.1知识产权.mp4',
  '07.2标准化基础知识.mp4',
  '08.1大数据.mp4',
  '08.2人工智能AI.mp4',
  '08.3物联网.mp4',
  '08.4云计算.mp4',
  '08.55G.mp4',
  '08.6互联网+.mp4',
  '08.7移动互联网.mp4',
  '08.8智慧城市.mp4',
  '09.1.1项目的定义与特点.mp4',
  '09.1.2项目的目标.mp4',
  '09.1.3项目管理-知识体系.mp4',
  '09.1.4项目干系人.mp4',
  '09.1.5项目经理.mp4',
  '09.1.6事业环境因素和组织过资产.mp4',
  '09.2.1组织结构.mp4',
  '09.2.2项目管理办公室（PMO）.mp4',
  '09.3项目生命周期.mp4',
  '09.4项目管理过程.mp4',
  '10.1项目建议.mp4',
  '10.2.1项目可行性研究内容.mp4',
  '10.2.2项目可行性研究阶段.mp4',
  '10.3项目招投标.mp4',
  '10.4供应商项目立项.mp4',
  '10.5案例分析.mp4',
  '11.1基本情况、整体管理的过程.mp4',
  '11.2制订项目章程.mp4',
  '11.3制订项目管理计划.mp4',
  '11.4指导和管理项目工作.mp4',
  '11.5监控项目工作.mp4',
  '11.6实施整体变更控制.mp4',
  '11.7结束项目或阶段.mp4',
  '12.1编制范围管理计划.mp4',
  '12.2收集需求.mp4',
  '12.3定义范围.mp4',
  '12.4创建工作分解结构.mp4',
  '12.5确认范围.mp4',
  '12.6控制范围.mp4',
  '13.1进度管理基本过程.mp4',
  '13.2规划进度管理.mp4',
  '13.3定义活动.mp4',
  '13.4排列活动顺序.mp4',
  '13.5估算活动资源.mp4',
  '13.6估算活动持续时间.mp4',
  '13.7制定进度计划01.mp4',
  '13.7制定进度计划02.mp4',
  '13.8控制进度.mp4',
  '13.9案例分析.mp4',
];

export default function () {
  useEffect(() => {
    console.log(123123);
  }, []);

  const linkTo = (item) => {
    router.push({
      pathname: '/detail',
      query: {
        a: encodeURIComponent(item),
      },
    });
  };

  return (
    <div id="scrollContainer" className={styles.normal}>
      {arr.map((item) => (
        <div onClick={() => linkTo(item)} className={styles.item} key={item}>
          {item}
        </div>
      ))}
    </div>
  );
}
